sisext-sapi-services/src/main/resources/soap/schemas/templates/soap-createDispatchOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://servicios.com.suppla.ws/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:CrearOrdenRequest>
            <CrearOrdenIn>
                <WSRequestHeader2>
                    <System>
                        <name>Suppla</name>
                        <correlationID>#[attributes.headers.'x-correlation-id']</correlationID>
                        <processingServer>#[attributes.headers.name]</processingServer>
                    </System>
                </WSRequestHeader2>
                <Orden>
                    <ordenDespacho>#[attributes.uriParams.'order_id']</ordenDespacho>
                    <cun>#[payload.createOrderRequest.createOrderIn.order.cunNumber]</cun>
                    <referencia>#[payload.createOrderRequest.createOrderIn.order.reference]</referencia>
                    <fecha>#[output application/java --- vars.date]</fecha>
                    <reenvio>
                        <ordenDespacho>#[payload.createOrderRequest.createOrderIn.order.resend.dispatchOrder]</ordenDespacho>
                        <cantidad>#[payload.createOrderRequest.createOrderIn.order.resend.quantity]</cantidad>
                    </reenvio>
                    <tipo>#[payload.createOrderRequest.createOrderIn.order.orderType]</tipo>
                    <tipoEntrega>#[payload.createOrderRequest.createOrderIn.order.entryType]</tipoEntrega>
                    <observaciones>#[payload.createOrderRequest.createOrderIn.order.observations]</observaciones>
                    <recaudo>
                        <requerido>#[payload.createOrderRequest.createOrderIn.order.collection.required]</requerido>
                        <valor>#[payload.createOrderRequest.createOrderIn.order.collection.value]</valor>
                    </recaudo>
                    <direccion>
                        <direccion>#[payload.createOrderRequest.createOrderIn.order.address.address]</direccion>
                        <barrio>#[payload.createOrderRequest.createOrderIn.order.address.district]</barrio>
                        <ciudad>#[payload.createOrderRequest.createOrderIn.order.address.city]</ciudad>
                        <departamento>#[payload.createOrderRequest.createOrderIn.order.address.department]</departamento>
                    </direccion>
                    <contacto>
                        <nombres>#[payload.createOrderRequest.createOrderIn.order.contact.names]</nombres>
                        <apellidos>#[payload.createOrderRequest.createOrderIn.order.contact.surnames]</apellidos>
                        <tipoDocumento>#[payload.createOrderRequest.createOrderIn.order.contact.documentType]</tipoDocumento>
                        <numeroDocumento>#[payload.createOrderRequest.createOrderIn.order.contact.documentNumber]</numeroDocumento>
                        <telefonoMovil>#[payload.createOrderRequest.createOrderIn.order.contact.mobilePhone]</telefonoMovil>
                        <telefonoMovil2>#[payload.createOrderRequest.createOrderIn.order.contact.mobilePhone2]</telefonoMovil2>
                        <telefonoFijo>#[payload.createOrderRequest.createOrderIn.order.contact.phoneNumber]</telefonoFijo>
                        <correo>#[payload.createOrderRequest.createOrderIn.order.contact.email]</correo>
                    </contacto>
                    <item>
                        <bodega>#[payload.createOrderRequest.createOrderIn.order.item.store]</bodega>
                        <material>#[payload.createOrderRequest.createOrderIn.order.item.material]</material>
                        <tipo>#[payload.createOrderRequest.createOrderIn.order.item.'type']</tipo>
                        <subtipo>#[payload.createOrderRequest.createOrderIn.order.item.subType]</subtipo>
                        <nombre>#[payload.createOrderRequest.createOrderIn.order.item.name]</nombre>
                        <campana>#[payload.createOrderRequest.createOrderIn.order.item.campaign]</campana>
                        <valor>#[payload.createOrderRequest.createOrderIn.order.item.value]</valor>
                        <cantidad>#[payload.createOrderRequest.createOrderIn.order.item.quantity]</cantidad>
                    </item>
                </Orden>
            </CrearOrdenIn>
        </ser:CrearOrdenRequest>
    </soapenv:Body>
</soapenv:Envelope>